Revit 2027 API
ParameterTypeId.PathReinEndHookOrient2Slab Property
 "Alternating Bar - End Hook Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PathReinEndHookOrient2Slab { get; }
Public Shared ReadOnly Property PathReinEndHookOrient2Slab As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PathReinEndHookOrient2Slab {
	ForgeTypeId^ get ();
}
static member PathReinEndHookOrient2Slab : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace